vintagepc/MINI404/hw/arm/prusa/stm32g070/stm32g070_rcc.c
/*
 * STM32 Microcontroller RCC (Reset and Clock Control) module
 * (STM32G070x variants)
 *
 * Copyright 2022 by VintagePC <http://github.com/vintagepc>
 *
 * Source code based on omap_clk.c
 * Implementation based on ST Microelectronics "RM0360 Reference Manual Rev 10"
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation; either version 2 of
 * the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */


#include "qemu/osdep.h"
#include "hw/core/sysbus.h"
#include "qom/object.h"
#include "hw/core/qdev-properties.h"
#include "migration/vmstate.h"
#include "qemu/timer.h"
#include <stdio.h>
#include "qemu/log.h"
#include "qemu/module.h"
#include "hw/core/irq.h"
#include "qemu/units.h"
// #define STATE_DEBUG_VAR rcc_dbg
#include "../stm32_common/stm32_types.h"
#include "../utility/macros.h"
#include "../stm32_common/stm32_rcc.h"
#include "../stm32_common/stm32_rcc_if.h"
#include "../stm32_common/stm32_rcc_regdefs.h"
#include "../stm32f407/stm32_clktree.h"
#include "../stm32f407/stm32.h"
#include "../stm32_common/stm32_clk.h"

/* DEFINITIONS*/

/* See README for DEBUG details. */
//#define DEBUG_STM32_RCC

#ifdef DEBUG_STM32_RCC
#define DPRINTF(fmt, ...)                                       \
do { printf("STM32F2XX_RCC: " fmt , ## __VA_ARGS__); } while (0)
#else
#define DPRINTF(fmt, ...)
#endif

#define IS_RESET_VALUE(new_value, mask, reset_value) ((new_value & mask) == (mask & reset_value))

QEMU_BUILD_BUG_MSG(STM32_P_COUNT>255,"Err - peripheral reset arrays not meant to handle >255 peripherals!");

static const uint8_t AHB_PERIPHS[32] = {
    STM32_P_DMA1, STM32_P_DMA2, 0, 0, 0, 0, 0, 0,
    STM32_P_FSMC, 0, 0, 0, STM32_P_CRC, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0
};

static const uint8_t APB1_PERIPHS[32] = {
    0, STM32_P_TIM3, STM32_P_TIM4, 0, STM32_P_TIM6, STM32_P_TIM7, 0, 0,
    STM32_P_USART5, STM32_P_USART6, 0, 0, 0, STM32_P_USBHS, STM32_P_SPI2, STM32_P_SPI3,
    0, STM32_P_USART2, STM32_P_USART3, STM32_P_USART4, 0, STM32_P_I2C1, STM32_P_I2C2, STM32_P_I2C3,
    0, 0, 0, 0, STM32_P_PWR, 0, 0, 0
};

static const uint8_t APB2_PERIPHS[32] = {
    STM32_P_SYSCFG, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, STM32_P_TIM1, STM32_P_SPI1, 0, STM32_P_USART1, STM32_P_TIM14,
    STM32_P_TIM15, STM32_P_TIM16, STM32_P_TIM17, 0, STM32_P_ADC1, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0
};

static const uint8_t GPIO_PERIPHS[32] = {
    STM32_P_GPIOA, STM32_P_GPIOB, STM32_P_GPIOC, STM32_P_GPIOD, STM32_P_GPIOE, STM32_P_GPIOF, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0
};

static const uint8_t (*PERIPH_BLOCKS[4])[32] = {
	&GPIO_PERIPHS, &AHB_PERIPHS, &APB1_PERIPHS, &APB2_PERIPHS
};

static const uint16_t AHBPRE_OPTS[16] = {
	[0b0000 ... 0b0111] = 1,
	[0b1000] = 2,
	[0b1001] = 4,
	[0b1010] = 8,
	[0b1011] = 16,
	[0b1100] = 64,
	[0b1101] = 128,
	[0b1110] = 256,
	[0b1111] = 512
};

static const uint8_t APBPRE_OPTS[8] = {
	[0b000 ... 0b011] = 1,
	[0b100] = 2,
	[0b101] = 4,
	[0b110] = 8,
	[0b111] = 16
};

enum reg_index {
	RI_CR,
	RI_ICSCR,
	RI_CFGR,
	RI_PLLCFGR,
	RI_RES1,
	RI_RES2,
	RI_CIER,
	RI_CIFR,
	RI_CICR,
	RI_IOPRSTR,
	RI_AHBRSTR,
	RI_APB1RSTR,
	RI_APB2RSTR,
	RI_IOPENR,
	RI_AHBENR,
	RI_ABP1ENR,
	RI_APB2ENR,
	RI_IOPSMENR,
	RI_AHBSMENR,
	RI_ABP1SMENR,
	RI_APB2SMENR,
	RI_CCIPR,
	RI_CCIPR2,
	RI_BDCR,
	RI_CSR,
	RI_END
};

OBJECT_DECLARE_SIMPLE_TYPE(STM32G070_STRUCT_NAME(Rcc), STM32G070_RCC);

REGDEF_BLOCK_BEGIN()
		REG_R(8);
		REG_B32(HSION);
		REG_B32(HSIKERON);
		REG_B32(HSIRDY);
		REG_K32(HSIDIV,3);
		REG_R(2);
		REG_B32(HSEON);
		REG_B32(HSERDY);
		REG_B32(HSEBYP);
		REG_B32(CSSON);
		REG_R(4);
		REG_B32(PLLON);
		REG_B32(PLLRDY);
		REG_R(6);
REGDEF_BLOCK_END(rcc,cr);

REGDEF_BLOCK_BEGIN()
	REG_K32(HSICAL,8);
	REG_K32(HSITRIM,7);
	REG_R(17);
REGDEF_BLOCK_END(rcc,icscr);

REGDEF_BLOCK_BEGIN()
		REG_K32(SW,3);
		REG_K32(SWS,3);
		REG_R(2);
		REG_K32(HPRE,4);
		REG_K32(PPRE,3);
		REG_RB();
		REG_K32(MCO2SEL,4);
		REG_K32(MCO2PRE,4);
		REG_K32(MCOSEL,4);
		REG_K32(MCOPRE,4);
REGDEF_BLOCK_END(rcc, cfgr);

REGDEF_BLOCK_BEGIN()
		REG_K32(PLLSRC,2);
		REG_R(2);
		REG_K32(PLLM,3);
		REG_RB();
		REG_K32(PLLN,7);
		REG_RB();
		REG_B32(PLLPEN);
		REG_K32(PLLP,5);
		REG_R(2);
		REG_B32(PLLQEN);
		REG_K32(PLLQ,3);
		REG_B32(PLLREN);
		REG_K32(PLLR,3);
REGDEF_BLOCK_END(rcc, pllcfgr);

REGDEF_BLOCK_BEGIN()
	REG_B32(LSIRDY);
	REG_B32(LSERDY);
	REG_RB();
	REG_B32(HSIRDY);
	REG_B32(HSERDY);
	REG_B32(PLLRDY);
	REG_R(2);
	REG_B32(CSS);
	REG_B32(LSECSS);
	REG_R(22);
REGDEF_BLOCK_END(rcc, inter);


REGDEF_BLOCK_BEGIN()
	REG_B32(GPIOA);
	REG_B32(GPIOB);
	REG_B32(GPIOC);
	REG_B32(GPIOD);
	REG_B32(GPIOE);
	REG_B32(GPIOF);
	REG_R(26);
REGDEF_BLOCK_END(rcc, ioport);

REGDEF_BLOCK_BEGIN()
	REG_B32(DMA1);
	REG_B32(DMA2);
	REG_R(6);
	REG_B32(FLASH);
	REG_R(3);
	REG_B32(CRC);
	REG_R(19);
REGDEF_BLOCK_END(rcc, ahb);

REGDEF_BLOCK_BEGIN()
	REG_RB();
	REG_B32(TIM3);
	REG_B32(TIM4);
	REG_RB();
	REG_B32(TIM6);
	REG_B32(TIM7);
	REG_R(2);
	REG_B32(UART5);
	REG_B32(UART6);
	REG_R(3);
	REG_B32(USB);
	REG_B32(SPI2);
	REG_B32(SPI3);
	REG_RB();
	REG_B32(USART2);
	REG_B32(USART3);
	REG_B32(USART4);
	REG_RB();
	REG_B32(I2C1);
	REG_B32(I2C2);
	REG_B32(I2C3);
	REG_R(3);
	REG_B32(DBG);
	REG_B32(PWREN);
	REG_R(3);
REGDEF_BLOCK_END(rcc, apb1);

REGDEF_BLOCK_BEGIN()
	REG_B32(SYSCFGEN);
	REG_R(10);
	REG_B32(TIM1);
	REG_B32(SPI1);
	REG_RB();
	REG_B32(USART1);
	REG_B32(TIM14);
	REG_B32(TIM15);
	REG_B32(TIM16);
	REG_B32(TIM17);
	REG_RB();
	REG_B32(ADC);
	REG_R(11);
REGDEF_BLOCK_END(rcc, apb2);

REGDEF_BLOCK_BEGIN()
	REG_K32(USART1SEL,2);
	REG_K32(USART2SEL,2);
	REG_K32(USART3SEL,2);
	REG_R(6);
	REG_K32(I2C1SEL,2);
	REG_K32(I2C2I2S1SEL,2);
	REG_R(6);
	REG_B32(TIM1SEL);
	REG_RB();
	REG_B32(TIM15SEL);
	REG_R(5);
	REG_K32(ADCSEL,2);
REGDEF_BLOCK_END(rcc, ccipr);

REGDEF_BLOCK_BEGIN()
	REG_K32(I2S1SEL,2);
	REG_K32(I2S2SEL,2);
	REG_R(8);
	REG_K32(USBSEL,2);
	REG_R(18);
REGDEF_BLOCK_END(rcc, ccipr2);

REGDEF_BLOCK_BEGIN()
	REG_B32(LSION);
	REG_B32(LSIRDY);
	REG_R(21);
	REG_B32(RMVF);
	REG_RB();
	REG_B32(OBLRSTF);
	REG_B32(PINRSTF);
	REG_B32(PORRSTF);
	REG_B32(SFTRSTF);
	REG_B32(IWDGRSTF);
	REG_B32(WWDGRSTF);
	REG_B32(LPWRSTF);
REGDEF_BLOCK_END(rcc, csr)

typedef struct STM32G070_STRUCT_NAME(Rcc) {
    /* Inherited -- MUST MATCH stm32_rcc.h. NO EXCEPTIONS. */
    STM32COMRccState parent;

    /* Additional clocks */
    Clk_t HSISYS,
	PLLCLK, PLLPCLK, PLLQCLK, PLLRCLK,
    SYSCLK,
    HCLK, /* Output from AHB Prescaler */
	HCLK8,
	PCLK,

    TIMPCLK; /* timer clock */

	union {
		struct {
			REGDEF_NAME(rcc,cr) 		CR; 		//0x00
			REGDEF_NAME(rcc,icscr) 		ICSCR;		//0x04
			REGDEF_NAME(rcc,cfgr) 		CFGR; 		//0x08
			REGDEF_NAME(rcc,pllcfgr) 	PLLCFGR; 	//0x0C
			REGDEF_R(0x10);
			REGDEF_R(0x14);
			REGDEF_NAME(rcc, inter) 	CIER; 		//0x18
			REGDEF_NAME(rcc, inter) 	CIFR; 		//0x1C
			REGDEF_NAME(rcc, inter) 	CICR; 		//0x20
			REGDEF_NAME(rcc, ioport) 	IOPRSTR;	//0x24
			REGDEF_NAME(rcc, ahb) 		AHBRSTR;	//0x28
			REGDEF_NAME(rcc, apb1) 		APBRSTR1;	//0x2C
			REGDEF_NAME(rcc, apb2) 		APBRSTR2;	//0x30
			REGDEF_NAME(rcc, ioport) 	IOPENR;		//0x34
			REGDEF_NAME(rcc, ahb) 		AHBENR;		//0x38
			REGDEF_NAME(rcc, apb1) 		APBENR1;	//0x3C
			REGDEF_NAME(rcc, apb2) 		APBENR2;	//0x40
			REGDEF_NAME(rcc, ioport) 	IOPSMENR;	//0x44
			REGDEF_NAME(rcc, ahb) 		AHBSMENR;	//0x48
			REGDEF_NAME(rcc, apb1) 		APBSMENR1;	//0x4C
			REGDEF_NAME(rcc, apb2) 		APBSMENR2;	//0x50
			REGDEF_NAME(rcc, ccipr)		CCIPR;		//0x54
			REGDEF_NAME(rcc, ccipr2)	CCIPR2;		//0x58
			REGDEF_NAME(rcc_com, bdcr)	BDCR; 		//0x5C
			REGDEF_NAME(rcc, csr) 		CSR;		//0x60

