vintagepc/MINI404/hw/arm/prusa/stm32g070/stm32g070_rcc.c
		} QEMU_PACKED;
		uint32_t raw[RI_END];
	} regs;

	qemu_irq* hclk_upd_irq;

} STM32G070_STRUCT_NAME(Rcc);


enum sw_src
{
	SW_HSISYS,
	SW_HSE,
	SW_PLLRCLK,
	SW_LSI,
	SW_LSE,
};

static const stm32_reginfo_t stm32g070_rcc_reginfo[RI_END] =
{
	[RI_CR] = {.mask = 0x30F3F00, .reset_val = 0x500},
	[RI_ICSCR] = {.mask = 0x7FFF, .reset_val = 0x4000, .unimp_mask = 0x7FFF},
	[RI_CFGR] = {.mask = 0xFFFF7F3F, .unimp_mask = 0xFFFF0000},
	[RI_PLLCFGR] = {.mask = 0xFF3F7F73, .reset_val =  0x1000},
	[RI_RES1 ... RI_RES2] = {.is_reserved = true},
	[RI_CIER] = {.mask = 0b111011},
	[RI_CIFR] = {.mask = 0b1100111011},
	[RI_CICR] = {.mask = 0b1100111011},
	[RI_IOPRSTR] = {.mask = 0x3F},
	[RI_IOPENR] = {.mask = 0x3F},
	[RI_IOPSMENR] = {.mask = 0x3F, .reset_val = 0x3F, .unimp_mask = 0x3F},
	[RI_AHBRSTR] = {.mask = 0x1103},
	[RI_AHBENR] = {.mask = 0x1103},
	[RI_AHBSMENR] = {.mask = 0x1103, .reset_val = 0x1103, .unimp_mask = 0x1103},
	[RI_APB1RSTR] = { .mask = 0x18EEE336},
	[RI_ABP1ENR] = { .mask = 0x18EEE336},
	[RI_ABP1SMENR] = { .mask = 0x18EEE336, .reset_val = 0x18EEE336, .unimp_mask = 0x18EEE336},
	[RI_APB2RSTR] = {.mask = 0x17D801},
	[RI_APB2ENR] = {.mask = 0x17D801},
	[RI_APB2SMENR] = {.mask = 0x17D801, .reset_val = 0x17D801, .unimp_mask = 0x17D801},
	[RI_CCIPR] = { .mask = 0xC140F03F},
	[RI_CCIPR2] = {.is_reserved = true, .mask = 0x300F},
	[RI_BDCR] = {.mask = 0x301837F, .unimp_mask = ~0x8303},
	[RI_CSR] = {.mask = 0xFE800003}
};

/* REGISTER IMPLEMENTATION */

/* Write the Configuration Register.
 * This updates the states of the corresponding clocks.  The bit values are not
 * saved - when the register is read, its value will be built using the clock
 * states.
 */
static void stm32_rcc_RCC_CR_write(STM32G070_STRUCT_NAME(Rcc) *s, uint32_t new_value, bool init)
{
	const REGDEF_NAME(rcc,cr) new = { .raw = new_value };

    if((clktree_is_enabled(&s->PLLCLK) && !new.PLLON && !init) &&
       s->regs.CFGR.SW == SW_PLLRCLK) {
        printf("PLL cannot be disabled while it is selected as the system clock.");
    }
    clktree_set_enabled(&s->PLLCLK, new.PLLON);
	s->regs.CR.PLLRDY = s->regs.CR.PLLON = new.PLLON;

    if((clktree_is_enabled(&s->parent.HSECLK) && !new.HSEON && !init) &&
       (s->regs.CFGR.SW == SW_HSE || s->regs.CFGR.SW == SW_PLLRCLK)
       ) {
        printf("HSE oscillator cannot be disabled while it is driving the system clock.");
    }
    clktree_set_enabled(&s->parent.HSECLK, new.HSEON);
	s->regs.CR.HSERDY = s->regs.CR.HSEON = new.HSEON;

	clktree_set_scale(&s->HSISYS, 1, 1U<<new.HSIDIV);

    if((clktree_is_enabled(&s->parent.HSECLK) && !new.HSEON && !init) &&
       (s->regs.CFGR.SW == SW_HSISYS || s->regs.CFGR.SW == SW_PLLRCLK)
       ) {
        printf("HSI oscillator cannot be disabled while it is driving the system clock.");
    }
    clktree_set_enabled(&s->parent.HSICLK, new.HSION);
	s->regs.CR.HSIRDY = s->regs.CR.HSION = new.HSION;
}

static void stm32_rcc_RCC_CFGR_write(STM32G070_STRUCT_NAME(Rcc) *s, uint32_t new_value, bool init)
{
	const REGDEF_NAME(rcc,cfgr) new = { .raw = new_value };
	// SW
	if (new.SW > 4)
	{
		qemu_log_mask(LOG_GUEST_ERROR, "Invalid clock source for SYSCLK selected!");
	}
	else
	{
		clktree_set_selected_input(&s->SYSCLK, new.SW);
		s->regs.CFGR.SWS = s->regs.CFGR.SW = new.SW;
	}

	// HPRE:
	clktree_set_scale(&s->HCLK, 1, AHBPRE_OPTS[new.HPRE]);
	s->regs.CFGR.HPRE = new.HPRE;

    /* PPRE */
    s->regs.CFGR.PPRE = new.PPRE;
	clktree_set_scale(&s->PCLK, 1, APBPRE_OPTS[new.PPRE]);

	clktree_set_scale(&s->TIMPCLK, (APBPRE_OPTS[new.PPRE] == 1U ? 1U : 2U), 1);
}

static void stm32_rcc_RCC_PLLCFGR_write(STM32G070_STRUCT_NAME(Rcc) *s, uint32_t new_value, bool init)
{
	const REGDEF_NAME(rcc,pllcfgr) new = { .raw = new_value };
	const REGDEF_NAME(rcc,pllcfgr) changed = { .raw = new_value^s->regs.PLLCFGR.raw };
	bool pll_on = s->regs.CR.PLLON;
	clktree_set_selected_input(&s->PLLCLK, (new.PLLSRC - 2));
	if (new.PLLN < 0b1000 || new.PLLN > 0b1010110 || pll_on )
	{
		qemu_log_mask(LOG_GUEST_ERROR, "Invalid PLL multiplier (N) selected or tried to change it while PLL enabled!");
	}
	else
	{
		clktree_set_scale(&s->PLLCLK, new.PLLN, new.PLLM + 1U);
	}

	bool pll_changed = pll_on && (
		changed.PLLSRC || changed.PLLQ || changed.PLLP || changed.PLLR
	);

	if (pll_changed)
	{
		qemu_log_mask(LOG_GUEST_ERROR, "Attempted to change PLL configuration while it is in use!");
	}

	clktree_set_enabled(&s->PLLPCLK, new.PLLPEN);
	if (new.PLLQ == 0 && changed.PLLQ)
	{
		qemu_log_mask(LOG_GUEST_ERROR, "Invalid PLLQ divisor selected!");
	}
	else
	{
		clktree_set_enabled(&s->PLLQCLK, new.PLLQEN);
		clktree_set_scale(&s->PLLQCLK, 1, new.PLLQ + 1U);
	}
	if (new.PLLR == 0 && changed.PLLR)
	{
		qemu_log_mask(LOG_GUEST_ERROR, "Invalid PLLR divisor selected!");
	}
	else
	{
		clktree_set_enabled(&s->PLLRCLK, new.PLLREN);
		clktree_set_scale(&s->PLLRCLK, 1, new.PLLR + 1U);
	}
	if (new.PLLP == 0 && changed.PLLP)
	{
		qemu_log_mask(LOG_GUEST_ERROR, "Invalid PLLP divisor selected!");
	}
	else
	{
		clktree_set_enabled(&s->PLLPCLK, new.PLLPEN);
		clktree_set_scale(&s->PLLPCLK, 1, new.PLLP + 1U);
	}
	s->regs.PLLCFGR.raw = new.raw;
}

static void stm32_rcc_RCC_CCIPR_write(STM32G070_STRUCT_NAME(Rcc) *s, uint32_t new_value, bool init)
{
	const REGDEF_NAME(rcc,ccipr) new = { .raw = new_value };

	clktree_set_selected_input(&s->parent.pclocks[STM32_P_USART1], new.USART1SEL);
	clktree_set_selected_input(&s->parent.pclocks[STM32_P_USART2], new.USART2SEL);
	clktree_set_selected_input(&s->parent.pclocks[STM32_P_USART3], new.USART3SEL);
	clktree_set_selected_input(&s->parent.pclocks[STM32_P_I2C1], new.I2C1SEL);
	clktree_set_selected_input(&s->parent.pclocks[STM32_P_I2C2], new.I2C2I2S1SEL);
	clktree_set_selected_input(&s->parent.pclocks[STM32_P_TIM1], new.TIM1SEL);
	clktree_set_selected_input(&s->parent.pclocks[STM32_P_TIM15], new.TIM15SEL);
	clktree_set_selected_input(&s->parent.pclocks[STM32_P_ADC1], new.ADCSEL);
	s->regs.CCIPR.raw = new.raw;
}

static void stm32_rcc_RCC_BDCR_writeb0(STM32G070_STRUCT_NAME(Rcc) *s, uint8_t new_value, bool init)
{
	REGDEF_NAME(rcc_com,bdcr) val = {.raw = new_value};
    clktree_set_enabled(&s->parent.LSECLK, val.LSEON);
	s->regs.BDCR.LSCOEN = s->regs.BDCR.LSERDY = val.LSEON;


	if (s->regs.BDCR.RTC_SEL)
	{
		qemu_log_mask(LOG_GUEST_ERROR, "Cannot change RTC clock source after it has been set!");
	}
	else if (val.RTC_SEL == 0)
	{
		clktree_set_enabled(&s->parent.pclocks[STM32_P_RTC], 0);
	}
	else
	{
		clktree_set_enabled(&s->parent.pclocks[STM32_P_RTC], val.RTCEN);
		clktree_set_selected_input(&s->parent.pclocks[STM32_P_RTC], val.RTC_SEL - 1U );
	}

