vintagepc/MINI404/hw/arm/prusa/stm32g070/stm32g070_rcc.c
}

static void stm32_rcc_RCC_BDCR_write(STM32G070_STRUCT_NAME(Rcc) *s, uint32_t new_value, bool init)
{
    stm32_rcc_RCC_BDCR_writeb0(s, new_value & 0xff, init);
}

/* Works the same way as stm32_rcc_RCC_CR_write */
static void stm32_rcc_RCC_CSR_write(STM32G070_STRUCT_NAME(Rcc) *s, uint32_t new_value, bool init)
{
	REGDEF_NAME(rcc,csr) val = { .raw = new_value };
    clktree_set_enabled(&s->parent.LSICLK, val.LSION);
	val.LSIRDY = val.LSION;
	s->regs.raw[RI_CSR] = val.raw;
}



static uint64_t stm32_rcc_readw(void *opaque, hwaddr offset)
{
    STM32G070_STRUCT_NAME(Rcc) *s = STM32G070_RCC(opaque);
	uint32_t index = offset >> 2U;
	CHECK_BOUNDS_R(index, RI_END, stm32g070_rcc_reginfo, "RCC");
	//rather than reconstruct the register each read, I ensure the stored value is current when changes happen.
	return s->regs.raw[index];
}

static void stm32_rcc_writeb(void *opaque, hwaddr offset, uint64_t value)
{
    STM32G070_STRUCT_NAME(Rcc) *s = STM32G070_RCC(opaque);

    switch (offset>>2U) {
    case RI_BDCR:
        stm32_rcc_RCC_BDCR_writeb0(s, value, false);
        break;
    default:
        STM32_BAD_REG(offset, 1U);
        break;
    }
}

static void stm32_rcc_writew(void *opaque, hwaddr offset,
                             uint64_t value, bool is_reset)
{
    STM32G070_STRUCT_NAME(Rcc) *s = STM32G070_RCC(opaque);

	uint8_t index = offset>>2U;

    switch(index) {
        case RI_CR:
            stm32_rcc_RCC_CR_write(s, value, is_reset);
            break;
        case RI_CFGR:
            stm32_rcc_RCC_CFGR_write(s, value, is_reset);
            break;
        case RI_PLLCFGR:
            stm32_rcc_RCC_PLLCFGR_write(s, value, is_reset);
            break;
        case RI_CCIPR:
            stm32_rcc_RCC_CCIPR_write(s, value, is_reset);
            break;
		case RI_IOPRSTR ... RI_APB2RSTR:
			stm32_common_rcc_reset_write(&s->parent,value, PERIPH_BLOCKS[index - RI_IOPRSTR]);
			s->regs.raw[index] = value;
			break;
		case RI_IOPENR ... RI_APB2ENR:
            stm32_common_rcc_enable_write(&s->parent, value, PERIPH_BLOCKS[index - RI_IOPENR]);
			s->regs.raw[index] = value;
            break;
		case RI_IOPSMENR ... RI_APB2SMENR:
			//printf("STOP MODE rcc write not implemetned!\n");
			s->regs.raw[index] = value;
			break;
        case RI_BDCR:
            stm32_rcc_RCC_BDCR_write(s, value, is_reset);
            break;
        case RI_CSR:
            stm32_rcc_RCC_CSR_write(s, value, is_reset);
            break;
			break;
        default:
            WARN_UNIMPLEMENTED_REG(offset, write);
            break;
    }
}

static uint64_t stm32_rcc_read(void *opaque, hwaddr offset,
                               unsigned size)
{
    switch(size) {
        case 4:
            return stm32_rcc_readw(opaque, offset);
        default:
            stm32_unimp("Unimplemented: RCC read from register at offset %08" HWADDR_PRIx, offset);
            return 0;
    }
}

static void stm32_rcc_write(void *opaque, hwaddr offset,
                            uint64_t value, unsigned size)
{
    switch(size) {
        case 4:
            stm32_rcc_writew(opaque, offset, value, false);
            break;
        case 1:
            stm32_rcc_writeb(opaque, offset, value);
            break;
        default:
            WARN_UNIMPLEMENTED_REG(offset, write);
            break;
    }
}

static const MemoryRegionOps stm32_rcc_ops = {
    .read = stm32_rcc_read,
    .write = stm32_rcc_write,
    .endianness = DEVICE_NATIVE_ENDIAN
};


static void stm32_rcc_reset(DeviceState *dev)
{
    STM32G070_STRUCT_NAME(Rcc) *s = STM32G070_RCC(dev);

	memset(&s->regs.raw, 0, sizeof(s->regs.raw));

	for (int i=0; i< RI_END; i++)
	{
		stm32_rcc_writew(dev, i<<2U, stm32g070_rcc_reginfo[i].reset_val, true);
	}
}

/* IRQ handler to handle updates to the HCLK frequency.
 * This updates the SysTick scales. */
static void stm32_rcc_hclk_upd_irq_handler(void *opaque, int n, int level)
{
    STM32G070_STRUCT_NAME(Rcc) *s = (STM32G070_STRUCT_NAME(Rcc) *)opaque;

    uint32_t hclk_freq = clktree_get_output_freq(&s->HCLK);

	clock_set_hz(s->parent.CPUCLOCK, hclk_freq);
	printf("# CPUCLOCK set to %u Hz\n",hclk_freq);
	clock_propagate(s->parent.CPUCLOCK);
	clock_set_hz(s->parent.REFCLK, hclk_freq/8);
	clock_propagate(s->parent.REFCLK);
	printf("# Systick frequency (REFCLK) set to %u Hz\n", hclk_freq/8);

#ifdef DEBUG_STM32_RCC
    DPRINTF("Cortex SYSTICK frequency set to %lu Hz (scale set to %d).\n",
            (unsigned long)hclk_freq, system_clock_scale);
#endif
}



/* DEVICE INITIALIZATION */

/* Set up the clock tree */
static void stm32_rcc_realize(DeviceState *dev, Error **errp)
{
    STM32G070_STRUCT_NAME(Rcc) *s = STM32G070_RCC(dev);

	s->parent.realize_func(dev, errp);

    int i;
   	s->hclk_upd_irq =
    qemu_allocate_irqs(stm32_rcc_hclk_upd_irq_handler, s, 1);

    /* Make sure all the peripheral clocks are null initially.
     * This will be used for error checking to make sure
     * an invalid clock is not referenced (not all of the
     * indexes will be used).
     */
    for(i = 0; i < STM32_P_COUNT; i++) {
        s->parent.pclocks[i].is_initialized = false;
    }

    /* Initialize clocks */
    /* Source clocks are initially disabled, which represents
     * a disabled oscillator.  Enabling the clock represents
     * turning the clock on.
     */

	clktree_create_clk(&s->HSISYS, "HSISYS", 1, 1, true, s->parent.hsi_freq, 0, &s->parent.HSICLK, NULL);

	// TODO - determine max sysclk freq.
    clktree_create_clk(&s->SYSCLK, "SYSCLK", 1, 1, true, 168000000, CLKTREE_NO_INPUT,
                                   &s->HSISYS, &s->parent.HSECLK, &s->PLLRCLK, &s->parent.LSICLK, &s->parent.LSECLK, NULL);

    clktree_create_clk(&s->HCLK, "HCLK", 1, 1, true, 64000000, 0, &s->SYSCLK, NULL);
    clktree_adduser(&s->HCLK, s->hclk_upd_irq[0]);
    clktree_create_clk(&s->HCLK8, "HCLK8", 1, 8, true, 8000000, 0, &s->HCLK, NULL);

    clktree_create_clk(&s->PCLK, "PCLK", 1, 1, true, 64000000, 0, &s->HCLK, NULL);

    clktree_create_clk(&s->PLLCLK, "PLLCLK", 1, 2, true, 48000000, 0, &s->parent.HSICLK, &s->parent.HSECLK,  NULL);
	clktree_create_clk(&s->PLLPCLK, "PLLP", 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PLLCLK, NULL);
	clktree_create_clk(&s->PLLQCLK, "PLLQ", 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PLLCLK, NULL);
	clktree_create_clk(&s->PLLRCLK, "PLLR", 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PLLCLK, NULL);

	clktree_create_clk(&s->TIMPCLK, "TIMPCLK", 1, 1, true, CLKTREE_NO_MAX_FREQ, 0, &s->PCLK, NULL);

    /* AHB Peripheral clocks */
    INIT_PCLK(GPIOA, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);
    INIT_PCLK(GPIOB, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);
    INIT_PCLK(GPIOC, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);
    INIT_PCLK(GPIOD, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);
    INIT_PCLK(GPIOE, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);
    INIT_PCLK(GPIOF, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);


// verified
    INIT_PCLK(CRC, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);
    INIT_PCLK(FSMC, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);
    INIT_PCLK(EXTI, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);
    INIT_PCLK(RCC, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);
    INIT_PCLK(DMAMUX, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);
    INIT_PCLK(DMA1, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);
    INIT_PCLK(DMA2, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);

    INIT_PCLK(USART1, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PCLK, &s->SYSCLK, &s->parent.HSICLK, &s->parent.LSECLK, NULL);
    INIT_PCLK(USART2, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PCLK, &s->SYSCLK, &s->parent.HSICLK, &s->parent.LSECLK, NULL);
    INIT_PCLK(USART3, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PCLK, &s->SYSCLK, &s->parent.HSICLK, &s->parent.LSECLK, NULL);

    INIT_PCLK(I2C1, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PCLK, &s->parent.LSECLK, &s->parent.HSICLK, &s->SYSCLK, NULL);
    INIT_PCLK(I2C2, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PCLK, &s->parent.LSECLK, &s->parent.HSICLK, &s->SYSCLK, NULL);

    INIT_PCLK(TIM1,  1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->TIMPCLK, &s->PLLQCLK, NULL);
    INIT_PCLK(TIM15,1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->TIMPCLK, &s->PLLQCLK, NULL);

    INIT_PCLK(ADC1, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->SYSCLK, &s->PLLPCLK, &s->parent.HSICLK, NULL);

	// Everything else is APB

    INIT_PCLK(SYSCFG, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PCLK, NULL);
    INIT_PCLK(USART4, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PCLK, NULL);
    INIT_PCLK(USART5, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PCLK, NULL);
    INIT_PCLK(USART6, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PCLK, NULL);
    INIT_PCLK(TIM3,   1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->TIMPCLK, NULL);
    INIT_PCLK(TIM6,   1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->TIMPCLK, NULL);
    INIT_PCLK(TIM7,   1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->TIMPCLK, NULL);;
    INIT_PCLK(TIM14, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->TIMPCLK, NULL);
    INIT_PCLK(TIM16, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->TIMPCLK, NULL);
    INIT_PCLK(TIM17, 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->TIMPCLK, NULL);
// vf'd end


    INIT_PCLK(IWDG, 1, 1, true, CLKTREE_NO_MAX_FREQ, 0, &s->parent.LSICLK, NULL);
    INIT_PCLK(PWR, 1, 1, true, CLKTREE_NO_MAX_FREQ, 0, &s->SYSCLK, NULL);
    INIT_PCLK(RTC, 1, 1, true, CLKTREE_NO_MAX_FREQ, 0, &s->parent.LSICLK, &s->parent.LSECLK, &s->parent.HSECLK, NULL);

